{
  "serviceProviders": [
    {
      "id": 1,
      "name": "Alice Johnson",
      "category": "Web Developer",
      "jobTitle": "Frontend Developer",
      "description": "Expert in building responsive and accessible web interfaces.",
      "detailedDescription": "Alice Johnson is a seasoned frontend developer with a strong background in creating highly responsive, accessible, and visually engaging websites and web applications. With over six years of experience in the tech industry, Alice has mastered frameworks like React, Vue.js, and Angular, and consistently delivers clean, maintainable code. She collaborates closely with designers and back-end engineers to build seamless user experiences that perform flawlessly across devices and browsers. Alice’s dedication to user-centric design, performance optimization, and industry best practices has earned her a reputation for reliability and excellence in every project she undertakes.",
      "payRate": "$40/hr",
      "completionRate": "97%",
      "ratings": 4.8,
      "location": "New York",
      "responseTime": "1 hour",
      "image": "wow.jpg",
      "services": ["Website Development", "API Integration", "Database Design", "UI/UX Optimization", "Performance Tuning"]
    },
    {
      "id": 2,
      "name": "Brian Lee",
      "category": "Plumber",
      "jobTitle": "Certified Plumber",
      "description": "Handles all plumbing emergencies and installations efficiently.",
      "detailedDescription": "Brian Lee is a licensed and insured plumber with more than a decade of hands-on experience in residential and commercial plumbing systems. He specializes in emergency leak repairs, water heater installations, bathroom remodeling, and pipe replacements. Known for his punctuality and clean work ethic, Brian combines traditional plumbing techniques with the latest tools and technologies to ensure long-lasting solutions. He prioritizes customer satisfaction by providing clear communication, fair pricing, and exceptional attention to detail. Whether it's a late-night emergency or a full plumbing overhaul, clients trust Brian to get the job done efficiently and professionally.",
      "payRate": "$35/hr",
      "completionRate": "92%",
      "ratings": 4.5,
      "location": "Los Angeles",
      "responseTime": "30 minutes",
      "image": "bob.jpg",
      "services": ["Logo Design", "Brand Guidelines", "Marketing Materials", "Social Media Graphics", "UI Design"]
    },
    {
      "id": 3,
      "name": "Carla Mendes",
      "category": "Graphic Designer",
      "jobTitle": "Visual Designer",
      "description": "Creates visually stunning designs for digital platforms.",
      "detailedDescription": "Carla Mendes is a creative and detail-oriented graphic designer with over eight years of experience crafting compelling visual identities for brands across various industries. Her expertise spans branding, digital marketing assets, UI/UX design, and social media content. Carla is fluent in tools like Adobe Illustrator, Photoshop, and Figma, and approaches each project with a focus on storytelling, consistency, and functionality. She’s passionate about helping clients visually communicate their values and stand out in competitive markets. Carla’s designs are not only aesthetically pleasing but strategically aligned with business goals, ensuring both beauty and impact.",
      "payRate": "$45/hr",
      "completionRate": "95%",
      "ratings": 4.7,
      "location": "San Francisco",
      "responseTime": "2 hours",
      "image": "mary.jpg",
      "services": ["SEO Audits", "Content Creation", "Keyword Research", "Link Building", "Analytics Reporting"]
    },
    {
      "id": 4,
      "name": "David Kim",
      "category": "Electrician",
      "jobTitle": "Residential Electrician",
      "description": "Reliable and safe electrical services for homes.",
      "detailedDescription": "David Kim provides safe and reliable electrical services for residential clients, bringing over 12 years of experience in wiring, repairs, and installations. He ensures that all projects comply with local safety codes and standards, focusing on delivering long-lasting and efficient electrical solutions. David is known for his professional approach, punctuality, and commitment to client satisfaction, handling everything from simple repairs to complex home rewiring projects with precision and care.",
      "payRate": "$30/hr",
      "completionRate": "90%",
      "ratings": 4.3,
      "location": "Houston",
      "responseTime": "1–2 hours",
      "image": "john.jpg",
      "services": ["iOS App Development", "UI Implementation", "Performance Testing", "Bug Fixing", "App Store Deployment"]
    },
    {
      "id": 5,
      "name": "Emily Clark",
      "category": "Content Writer",
      "jobTitle": "SEO Content Specialist",
      "description": "Writes engaging content optimized for search engines.",
      "detailedDescription": "Emily Clark is an accomplished SEO content specialist with a talent for crafting engaging, keyword-optimized content that drives organic traffic and boosts online visibility. With over seven years of experience, she writes compelling blog posts, articles, and marketing copy tailored to target audiences. Emily combines her creative writing skills with data-driven SEO strategies to deliver content that not only reads well but also performs effectively on search engines.",
      "payRate": "$25/hr",
      "completionRate": "98%",
      "ratings": 4.9,
      "location": "Chicago",
      "responseTime": "4 hours",
      "image": "njoki.jpg",
      "services": ["Wedding Photography", "Portrait Sessions", "Event Coverage", "Photo Editing", "Photo Album Design"]
    },
    {
      "id": 6,
      "name": "Frank Okoro",
      "category": "Mechanic",
      "jobTitle": "Auto Repair Technician",
      "description": "Specializes in diagnosing and repairing vehicle issues.",
      "detailedDescription": "Frank Okoro is an experienced auto repair technician with a comprehensive skill set in vehicle diagnostics, maintenance, and repair. He has worked on a wide range of makes and models, providing timely and effective solutions to mechanical problems. Frank’s thorough inspections and honest communication help vehicle owners understand the necessary repairs while ensuring safety and performance are maintained at optimal levels.",
      "payRate": "$50/hr",
      "completionRate": "88%",
      "ratings": 4.2,
      "location": "Phoenix",
      "responseTime": "3 hours",
      "image": "mec.jpg",
      "services": ["Bridal Makeup", "Party Makeup", "Fashion Makeup", "Photoshoot Makeup", "Makeup Consultations"]
    },
    {
      "id": 7,
      "name": "Grace Liu",
      "category": "Tutor",
      "jobTitle": "Math Tutor",
      "description": "Helps students master math with clarity and patience.",
      "detailedDescription": "Grace Liu is a passionate and patient math tutor dedicated to helping students from middle school through college achieve mastery in mathematics. She specializes in algebra, geometry, calculus, and standardized test prep. Grace uses personalized teaching methods to simplify complex concepts, boost confidence, and improve academic performance. Her flexible approach caters to individual learning styles, making math accessible and enjoyable for all her students.",
      "payRate": "$20/hr",
      "completionRate": "99%",
      "ratings": 5.0,
      "location": "Seattle",
      "responseTime": "45 minutes",
      "image": "grace.jpg",
      "services": ["Pipe Repair", "Drain Cleaning", "Water Heater Installation", "Leak Detection", "Fixture Replacement"]
    },
    {
      "id": 8,
      "name": "Henry Zhao",
      "category": "Photographer",
      "jobTitle": "Event Photographer",
      "description": "Captures timeless moments with professional precision.",
      "detailedDescription": "Henry Zhao is a professional event photographer known for capturing candid, meaningful moments with artistic precision. With a background in portrait and wedding photography, he brings creativity and professionalism to every shoot. Henry uses advanced equipment and editing techniques to deliver high-quality images that tell a story and preserve memories for a lifetime. His friendly demeanor and attention to detail ensure a comfortable experience for clients during events.",
      "payRate": "$60/hr",
      "completionRate": "93%",
      "ratings": 4.6,
      "location": "Miami",
      "responseTime": "2–3 hours",
      "image": "hnry.jpg",
      "services": ["One-on-One Training", "Nutrition Plans", "Strength Training", "Cardio Sessions", "Online Coaching"]
    },
    {
      "id": 9,
      "name": "Isabella Rossi",
      "category": "Interior Designer",
      "jobTitle": "Home Decor Consultant",
      "description": "Transforms spaces into beautiful and functional homes.",
      "detailedDescription": "Isabella Rossi is an innovative interior designer specializing in transforming residential spaces into beautiful, functional environments. With a keen eye for color, texture, and spatial planning, she creates personalized designs that reflect her clients' tastes and lifestyles. Isabella collaborates with architects, contractors, and vendors to bring each project to life while maintaining budgets and timelines. Her commitment to blending aesthetics with practicality has earned her widespread recognition.",
      "payRate": "$70/hr",
      "completionRate": "96%",
      "ratings": 4.8,
      "location": "Atlanta",
      "responseTime": "1 day",
      "image": "home.jpg",
      "services": ["Wiring & Rewiring", "Lighting Installation", "Circuit Breaker Repair", "Safety Inspections", "Electrical Maintenance"]
    },
    {
      "id": 10,
      "name": "Jack Thompson",
      "category": "Web Developer",
      "jobTitle": "Full Stack Developer",
      "description": "Builds scalable and robust web applications.",
      "detailedDescription": "Jack Thompson is a skilled full stack developer with expertise in both frontend and backend technologies. He develops scalable, efficient web applications using React, Node.js, Express, and MongoDB. Jack focuses on writing clean, modular code and implementing best practices for security and performance. He works closely with product teams to translate business requirements into technical solutions, ensuring projects are delivered on time and exceed client expectations.",
      "payRate": "$55/hr",
      "completionRate": "94%",
      "ratings": 4.7,
      "location": "Denver",
      "responseTime": "6 hours",
      "image": "web.jpg",
      "services": ["Private Dining", "Event Catering", "Menu Planning", "Meal Prep", "Cooking Classes"]
    },
    {
      "id": 11,
      "name": "Karen Ahmed",
      "category": "Digital Marketer",
      "jobTitle": "PPC Specialist",
      "description": "Optimizes ad campaigns to deliver maximum ROI.",
      "detailedDescription": "Karen Ahmed is a results-driven PPC specialist with extensive experience managing advertising campaigns across platforms like Google Ads and Facebook Ads. She excels at keyword research, bid management, and A/B testing to maximize return on investment. Karen stays current with digital marketing trends and leverages analytics tools to optimize campaign performance continuously. Her strategic approach helps businesses increase brand awareness, generate leads, and grow sales efficiently.",
      "payRate": "$38/hr",
      "completionRate": "91%",
      "ratings": 4.4,
      "location": "Boston",
      "responseTime": "3 hours",
      "image": "ppc.jpg",
      "services": ["Engine Diagnostics", "Oil Changes", "Brake Repairs", "Tire Replacement", "Suspension Work"]
    },
    {
      "id": 12,
      "name": "Liam Scott",
      "category": "Carpenter",
      "jobTitle": "Furniture Maker",
      "description": "Custom woodwork built with care and craftsmanship.",
      "detailedDescription": "Liam Scott is an expert carpenter specializing in custom furniture and bespoke woodwork. With over 15 years of experience, Liam crafts pieces that combine traditional techniques with modern designs. He works closely with clients to understand their vision and brings it to life using high-quality materials and precise craftsmanship. Liam’s dedication to detail and durability ensures that every piece is both beautiful and built to last.",
      "payRate": "$45/hr",
      "completionRate": "89%",
      "ratings": 4.5,
      "location": "Austin",
      "responseTime": "1 day",
      "image": "carp.jpg",
      "services": ["Bespoke Tailoring", "Alterations", "Wedding Gowns", "Suits & Jackets", "Pattern Drafting"]
    },
    {
      "id": 13,
      "name": "Maya Patel",
      "category": "Yoga Instructor",
      "jobTitle": "Certified Yoga Trainer",
      "description": "Guides personalized sessions for physical and mental wellness.",
      "detailedDescription": "Maya Patel is a certified yoga instructor dedicated to helping clients achieve physical fitness and mental clarity through personalized yoga sessions. She integrates breathwork, meditation, and traditional asanas to create balanced routines tailored to individual needs and goals. Maya’s holistic approach emphasizes mindfulness and body awareness, making her classes suitable for beginners and advanced practitioners alike. Her warm and supportive teaching style fosters a welcoming environment for growth and healing.",
      "payRate": "$30/hr",
      "completionRate": "97%",
      "ratings": 4.9,
      "location": "Portland",
      "responseTime": "2 hours",
      "image": "yoga.jpg",
      "services": ["REST API Development", "Database Management", "Security Implementation", "DevOps", "Code Reviews"]
    },
    {
      "id": 14,
      "name": "Noah Bennett",
      "category": "IT Support",
      "jobTitle": "Technical Support Specialist",
      "description": "Solves software and hardware issues quickly and effectively.",
      "detailedDescription": "Noah Bennett is a reliable technical support specialist who provides fast and effective solutions to hardware and software problems. With a solid background in network administration and troubleshooting, Noah assists both individuals and businesses in maintaining smooth IT operations. He offers remote and onsite support, ensuring minimal downtime and clear communication throughout the process. Noah’s ability to simplify complex technical issues makes him a valuable resource for clients seeking dependable tech assistance.",
      "payRate": "$28/hr",
      "completionRate": "93%",
      "ratings": 4.6,
      "location": "Philadelphia",
      "responseTime": "90 minutes",
      "image": "tech.jpg",
      "services": ["Space Planning", "Color Consultation", "Furniture Selection", "3D Visualization", "Project Management"]
    },
    {
      "id": 15,
      "name": "Olivia Wright",
      "category": "Makeup Artist",
      "jobTitle": "Bridal Makeup Specialist",
      "description": "Delivers flawless looks for weddings and special events.",
      "detailedDescription": "Olivia Wright is an expert makeup artist specializing in bridal and event makeup. With a keen eye for detail and an artistic touch, Olivia enhances natural beauty to create stunning, long-lasting looks that photograph beautifully. She uses premium products tailored to each client’s skin type and preferences, ensuring comfort and durability throughout the day. Olivia’s friendly and professional approach makes her a favorite among brides and event organizers looking for flawless makeup artistry.",
      "payRate": "$80/hr",
      "completionRate": "99%",
      "ratings": 5.0,
      "location": "Las Vegas",
      "responseTime": "1 hour",
      "image": "make up.jpg",
      "services": ["Math Tutoring", "Physics Tutoring", "Exam Preparation", "Homework Help", "STEM Mentoring"]
    }
  ]
}
